Функция: Вычисление корней квадратного уравнения

Сценарий: Если дискриминант квадратного уравнения больше 0, то квадратное уравнение имеет два корня кратности 1
Квадратное уравнение с коэффициентами (1, 0, -1)
вычисляются корни квадратного уравнения
квадратное уравнение имеет два корня (1, -1) кратности один 

Сценарий: Если дискриминант квадратного уравнения равен 0, то квадратное уравнение имеет один корень кратности 2
Квадратное уравнение с коэффициентами (1, -2, 1)
вычисляются корни квадратного уравнения
квадратное уравнение имеет один корень 1 кратности два

Сценарий: Если дискриминант квадратного уравнения меньше 0, то квадратное уравнение не имеет корней
Квадратное уравнение с коэффициентами (1, 0, 1)
вычисляются корни квадратного уравнения
множество корней квадратного уравнения пустое

Сценарий: Коэффициент a квадратного уравнения не может быть равен 0
Квадратное уравнение с коэффициентами (1e-7, 0, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент a квадратного уравнение не может быть не числом 
Квадратное уравнение с коэффициентами (NaN, 0, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент a квадратного уравнение не может быть положительной бесконечностью 
Квадратное уравнение с коэффициентами (Double.PositiveInfinity, 0, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент a квадратного уравнение не может быть отрицательной бесконечностью 
Квадратное уравнение с коэффициентами (Double.NegativeInfinity, 0, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент b квадратного уравнение не может быть не числом 
Квадратное уравнение с коэффициентами (1, NaN, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент b квадратного уравнение не может быть положительной бесконечностью 
Квадратное уравнение с коэффициентами (1, Double.PositiveInfinity, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент b квадратного уравнение не может быть отрицательной бесконечностью 
Квадратное уравнение с коэффициентами (1, Double.NegativeInfinity, 1)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент c квадратного уравнение не может быть не числом 
Квадратное уравнение с коэффициентами (1, 0, NaN)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент c квадратного уравнение не может быть положительной бесконечностью 
Квадратное уравнение с коэффициентами (1, 0, Double.PositiveInfinity)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException

Сценарий: Коэффициент c квадратного уравнение не может быть отрицательной бесконечностью 
Квадратное уравнение с коэффициентами (1, 0, Double.NegativeInfinity)
вычисляются корни квадратного уравнения
выбрасывается исключение ArgumentException